In [63]:
import pandas as pd
import numpy as np
students_perfomance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

students_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [62]:
students_perfomance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [114]:
students_perfomance.iloc[[0, 3, 10], [0, 2, 5]]

    gender parental level of education  math score
0   female           bachelor's degree          72
3     male          associate's degree          47
10    male          associate's degree          58

In [8]:
students_perfomance_with_names = students_perfomance.iloc[[0, 1, 2, 5, 6]]

In [ ]:
students_perfomance_with_names.index = ["Igor", "Vladimir", "Mikhail", "Ivan", "Dmitry"]

In [ ]:
students_perfomance_with_names

In [ ]:
students_perfomance_with_names.loc[["Igor", "Ivan", "Dmitry"], ["math score", "test preparation course"]]

In [ ]:
students_perfomance_with_names.iloc[:, 0]

In [ ]:
my_series_1 = pd.Series([1, 2, 3], index=["Igor", "Ivan", "Dmitry"])
my_series_2 = pd.Series([4, 6, 6], index=["Igor", "Ivan", "Dmitry"])

In [ ]:
pd.DataFrame({"col_name_1":my_series_1,"col_name_2":my_series_2})

In [ ]:
students_perfomance.iloc[0:7]

In [ ]:
students_perfomance.loc[:6]

In [ ]:
students_perfomance_with_names.size

In [ ]:
students_perfomance.loc[students_perfomance.gender == "female", ["gender", "writing score"]]

In [ ]:
avg = students_perfomance["writing score"].mean()  # среднее значение

In [ ]:
students_perfomance.loc[(students_perfomance.gender == "female") & (students_perfomance["writing score"] > avg), ["gender", "writing score"]]

In [ ]:
len(students_perfomance.loc[students_perfomance["lunch"] == "free/reduced"]) / len(students_perfomance)

In [58]:
students_perfomance["lunch"].var

<bound method Series.var of 0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object>

In [71]:
students_perfomance.loc[students_perfomance["lunch"] == "free/reduced"].var(numeric_only=True)

math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [75]:
students_perfomance.loc[students_perfomance["lunch"] == "standard"].var(numeric_only=True)

math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

In [73]:
students_perfomance.loc[students_perfomance["lunch"] == "free/reduced"].mean(numeric_only=True)

math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64

In [76]:
students_perfomance.loc[students_perfomance["lunch"] == "standard"].mean(numeric_only=True)

math score       70.034109
reading score    71.654264
writing score    70.823256
dtype: float64

In [90]:
dota2 = pd.read_csv("dota_hero_stats.csv")
dota2.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [99]:
dota2.groupby(["attack_type", "primary_attr"]).aggregate({"name": "count"})

                          name
attack_type primary_attr
Melee       agi             19
            int              2
            str             35
Ranged      agi             18
            int             40
            str              3

In [96]:
zp = pd.read_csv("accountancy.csv")
zp.groupby(["Executor", "Type"]).aggregate({"Salary": "mean"})

                   Salary
Executor Type
Loopa    A      58.000000
         B     145.166667
         C     154.333333
         D     137.714286
         E     164.000000
         F     238.000000
Pupa     A     160.833333
         B      77.000000
         C      74.500000
         D     146.500000
         E     131.200000
         F     136.250000

In [102]:
new = pd.read_csv("algae.csv")
new.head()

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886

In [103]:
concentrations = new.groupby("genus", as_index=False)

In [105]:
mean_concentrations = concentrations.aggregate({"sucrose": "mean", "alanin": "mean", "citrate": "mean", "glucose": "mean", "oleic_acid": "mean"})

In [126]:
concentrations.aggregate({"alanin": "min"})

               alanin
genus
Ascophyllum  0.875429
Cladophora   1.648450
Fucus        0.346431
Palmaria     3.176440
Saccharina   1.255251

In [134]:
new.loc[new.genus == "Fucus"].groupby("genus").aggregate({"alanin":"max"})

         alanin
genus
Fucus  6.641303